In [1]:
import pandas as pd

In [57]:
df = pd.DataFrame([{'name':'a', 'value':1}, {'name':'b', 'value':2}, {'name':'c', 'value':3}])
df

  name  value
0    a      1
1    b      2
2    c      3

In [12]:
lst = {i:[2,4,6]  for i in ['a', 'b', 'c']}
lst
# df2 = pd.DataFrame(lst)
# df2.columns = ['add']
# df2['name'] = 'a'
# df2

{'a': [2, 4, 6], 'b': [2, 4, 6], 'c': [2, 4, 6]}

In [28]:
a = [i*3for i in [['a'], ['b'], ['c']]]
a

[['a', 'a', 'a'], ['b', 'b', 'b'], ['c', 'c', 'c']]

In [40]:
print(*a)

['a', 'a', 'a'] ['b', 'b', 'b'] ['c', 'c', 'c']

In [6]:
df1 = df.iloc[:1, :].copy()
df1

  name  value
0    a      1

In [9]:
df3 = df1.merge(df2)
df3['sum'] = df3['value'] + df3['add']
df3

  name  value  add  sum
0    a      1    2    3
1    a      1    4    5
2    a      1    6    7

In [61]:
df = pd.DataFrame([{'name':'a', 'value':1}, {'name':'b', 'value':2}, {'name':'c', 'value':3}])
df

  name  value
0    a      1
1    b      2
2    c      3

In [56]:
lst1 = ['a']*3 + ['b']*3 + ['c']*3
lst2 = [2,4,6]*3
df_add = pd.DataFrame({'name':lst1, 'add':lst2})
df_add

  name  add
0    a    2
1    a    4
2    a    6
3    b    2
4    b    4
5    b    6
6    c    2
7    c    4
8    c    6

In [60]:
df2 = df.merge(df_add)
df2['sum'] = df2['value'] + df2['add']
df2

  name  value  add  sum
0    a      1    2    3
1    a      1    4    5
2    a      1    6    7
3    b      2    2    4
4    b      2    4    6
5    b      2    6    8
6    c      3    2    5
7    c      3    4    7
8    c      3    6    9